code-review/Экзамен/ОУ_ПартионныйУчет/config/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/Enums/МетодыОценкиЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МетодыОценкиЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LIFO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/Catalogs/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПартииТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/Экзамен/ОУ_ПартионныйУчет/config/CommonModules/УчетТоваров/Ext/Module.bsl
// Описание: Формирует движения приходной накладной по регистру ТоварыНаСкладах.
// Для товаров создается партия; услуги на склад не приходуются.
//
// Параметры:
// ДокументОбъект - ДокументОбъект.ПриходнаяНакладная - проводимый документ
// Отказ - Булево - признак отказа в проведении
//
Процедура ВыполнитьПроведениеПрихода(ДокументОбъект, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения = ДокументОбъект.Движения.ТоварыНаСкладах;
	Движения.Записывать = Истина;
	Движения.Очистить();

	ТипыНоменклатуры = ПолучитьТипыНоменклатурыПакетом(ДокументОбъект.Товары);

	Для Каждого СтрокаТовара Из ДокументОбъект.Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		ТипНоменклатуры = ТипыНоменклатуры.Получить(СтрокаТовара.Номенклатура);
		Если ТипНоменклатуры = Неопределено Тогда
			ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		КонецЕсли;

		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТовара.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТовара.Партия) Тогда
			ПартияСсылка = СтрокаТовара.Партия;
			ОбновитьПартиюПрихода(ПартияСсылка, ДокументОбъект, СтрокаТовара);
		Иначе
			ПартияСсылка = СоздатьПартиюПрихода(ДокументОбъект, СтрокаТовара);
			СтрокаТовара.Партия = ПартияСсылка;
		КонецЕсли;

		Движение = Движения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДокументОбъект.Дата;
		Движение.Склад = ДокументОбъект.Склад;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.Партия = ПартияСсылка;
		Движение.Количество = СтрокаТовара.Количество;
		Движение.Стоимость = СтрокаТовара.Сумма;

	КонецЦикла;

КонецПроцедуры

// Описание: Формирует движения расходной накладной с контролем остатков
// и списанием по методу учетной политики на дату документа (FIFO/LIFO/по средней).
// Остатки и типы номенклатуры читаются пакетно (один-два запроса на документ).
//
// Параметры:
// ДокументОбъект - ДокументОбъект.РасходнаяНакладная - проводимый документ
// Отказ - Булево - признак отказа в проведении
//
Процедура ВыполнитьПроведениеРасхода(ДокументОбъект, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДвиженияТовары = ДокументОбъект.Движения.ТоварыНаСкладах;
	ДвиженияТовары.Записывать = Истина;
	ДвиженияТовары.Очистить();

	ДвиженияПродажи = ДокументОбъект.Движения.Продажи;
	ДвиженияПродажи.Записывать = Истина;
	ДвиженияПродажи.Очистить();

	МетодОценки = УчетнаяПолитикаСервер.МетодОценкиНаДату(ДокументОбъект.Дата);
	СообщенияНедостачи = Новый Массив;

	ТипыНоменклатуры = ПолучитьТипыНоменклатурыПакетом(ДокументОбъект.Товары);
	НоменклатураТоваров = Новый Массив;
	Для Каждого СтрокаТовара Из ДокументОбъект.Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТовара.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		ТипНоменклатуры = ТипыНоменклатуры.Получить(СтрокаТовара.Номенклатура);
		Если ТипНоменклатуры = Неопределено Тогда
			ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		КонецЕсли;
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;

		Если НоменклатураТоваров.Найти(СтрокаТовара.Номенклатура) = Неопределено Тогда
			НоменклатураТоваров.Добавить(СтрокаТовара.Номенклатура);
		КонецЕсли;

	КонецЦикла;

	ОстаткиПартий = ПолучитьОстаткиПартийПакетом(
		ДокументОбъект.Склад,
		НоменклатураТоваров,
		ДокументОбъект.МоментВремени());

	Если МетодОценки = Перечисления.МетодыОценкиЗапасов.LIFO Тогда
		ОстаткиПартий.Сортировать("Номенклатура Возр, ДатаПоступления Убыв, Партия Убыв");
	Иначе
		ОстаткиПартий.Сортировать("Номенклатура Возр, ДатаПоступления Возр, Партия Возр");
	КонецЕсли;

	СредниеЦены = Новый Соответствие;
	Если МетодОценки = Перечисления.МетодыОценкиЗапасов.ПоСредней Тогда
		СредниеЦены = РассчитатьСредниеЦеныПоНоменклатуре(ОстаткиПартий);
	КонецЕсли;

	// Индекс строк остатков по номенклатуре для быстрого обхода
	ИндексОстатков = ПостроитьИндексОстатковПоНоменклатуре(ОстаткиПартий);

	Для Каждого СтрокаТовара Из ДокументОбъект.Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаТовара.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		ТипНоменклатуры = ТипыНоменклатуры.Получить(СтрокаТовара.Номенклатура);
		Если ТипНоменклатуры = Неопределено Тогда
			ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		КонецЕсли;

		СуммаПродажи = СтрокаТовара.Сумма;
		Себестоимость = 0;

		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда

			ДвижениеПродажи = ДвиженияПродажи.Добавить();
			ДвижениеПродажи.Период = ДокументОбъект.Дата;
			ДвижениеПродажи.Склад = ДокументОбъект.Склад;
			ДвижениеПродажи.Номенклатура = СтрокаТовара.Номенклатура;
			ДвижениеПродажи.Контрагент = ДокументОбъект.Контрагент;
			ДвижениеПродажи.Количество = СтрокаТовара.Количество;
			ДвижениеПродажи.СуммаПродажи = СуммаПродажи;
			ДвижениеПродажи.Себестоимость = 0;
			Продолжить;

		КонецЕсли;

		СредняяЦена = 0;
		Если МетодОценки = Перечисления.МетодыОценкиЗапасов.ПоСредней Тогда
			ЦенаИзСоответствия = СредниеЦены.Получить(СтрокаТовара.Номенклатура);
			Если ЦенаИзСоответствия <> Неопределено Тогда
				СредняяЦена = ЦенаИзСоответствия;
			КонецЕсли;
		КонецЕсли;

		ИндексыСтрок = ИндексОстатков.Получить(СтрокаТовара.Номенклатура);
		РезультатСписания = СписатьИзЛокальныхОстатков(
			ОстаткиПартий,
			ИндексыСтрок,
			СтрокаТовара.Количество,
			МетодОценки,
			СредняяЦена,
			СтрокаТовара.Партия);

		Если РезультатСписания.Недостача > 0 Тогда
			ТекстНедостачи = СтрШаблон(
				"Недостаточно товара ""%1"" на складе ""%2"". Недостача: %3",
				Строка(СтрокаТовара.Номенклатура),
				Строка(ДокументОбъект.Склад),
				Формат(РезультатСписания.Недостача, "ЧЦ=15; ЧДЦ=3"));
			СообщенияНедостачи.Добавить(ТекстНедостачи);
			Продолжить;
		КонецЕсли;

		Для Каждого СтрокаСписания Из РезультатСписания.СтрокиСписания Цикл

			Движение = ДвиженияТовары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДокументОбъект.Дата;
			Движение.Склад = ДокументОбъект.Склад;
			Движение.Номенклатура = СтрокаТовара.Номенклатура;
			Движение.Партия = СтрокаСписания.Партия;
			Движение.Количество = СтрокаСписания.Количество;
			Движение.Стоимость = СтрокаСписания.Стоимость;
			Себестоимость = Себестоимость + СтрокаСписания.Стоимость;

		КонецЦикла;

		ДвижениеПродажи = ДвиженияПродажи.Добавить();
		ДвижениеПродажи.Период = ДокументОбъект.Дата;
		ДвижениеПродажи.Склад = ДокументОбъект.Склад;
		ДвижениеПродажи.Номенклатура = СтрокаТовара.Номенклатура;
		ДвижениеПродажи.Контрагент = ДокументОбъект.Контрагент;
		ДвижениеПродажи.Количество = СтрокаТовара.Количество;
		ДвижениеПродажи.СуммаПродажи = СуммаПродажи;
		ДвижениеПродажи.Себестоимость = Себестоимость;

	КонецЦикла;

	Если СообщенияНедостачи.Количество() > 0 Тогда
		Отказ = Истина;
		Для Каждого ТекстСообщения Из СообщенияНедостачи Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
		ДвиженияТовары.Очистить();
		ДвиженияПродажи.Очистить();
	КонецЕсли;

КонецПроцедуры

// Описание: Формирует ручные движения документа КорректировкаРегистров.
//
// Параметры:
// ДокументОбъект - ДокументОбъект.КорректировкаРегистров - проводимый документ
// Отказ - Булево - признак отказа в проведении
//
Процедура ВыполнитьПроведениеКорректировки(ДокументОбъект, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ДвиженияТовары = ДокументОбъект.Движения.ТоварыНаСкладах;
	ДвиженияТовары.Записывать = Истина;
	ДвиженияТовары.Очистить();

	Для Каждого СтрокаДвижения Из ДокументОбъект.ТоварыНаСкладах Цикл

		Движение = ДвиженияТовары.Добавить();
		Если СтрокаДвижения.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		Движение.Период = ДокументОбъект.Дата;
		Движение.Склад = СтрокаДвижения.Склад;
		Движение.Номенклатура = СтрокаДвижения.Номенклатура;
		Движение.Партия = СтрокаДвижения.Партия;
		Движение.Количество = СтрокаДвижения.Количество;
		Движение.Стоимость = СтрокаДвижения.Стоимость;

	КонецЦикла;

	ДвиженияПродажи = ДокументОбъект.Движения.Продажи;
	ДвиженияПродажи.Записывать = Истина;
	ДвиженияПродажи.Очистить();

	Для Каждого СтрокаПродажи Из ДокументОбъект.Продажи Цикл

		Движение = ДвиженияПродажи.Добавить();
		Движение.Период = ДокументОбъект.Дата;
		Движение.Склад = СтрокаПродажи.Склад;
		Движение.Номенклатура = СтрокаПродажи.Номенклатура;
		Движение.Контрагент = СтрокаПродажи.Контрагент;
		Движение.Количество = СтрокаПродажи.Количество;
		Движение.СуммаПродажи = СтрокаПродажи.СуммаПродажи;
		Движение.Себестоимость = СтрокаПродажи.Себестоимость;

	КонецЦикла;

КонецПроцедуры

// Описание: Подбирает партии к списанию по методу оценки (FIFO/LIFO/по средней).
// Сохранена для совместимости; проведение расхода использует пакетный путь.
//
// Параметры:
// Склад - СправочникСсылка.Склады - склад списания
// Номенклатура - СправочникСсылка.Номенклатура - номенклатура
// КоличествоКСписанию - Число - требуемое количество
// МоментВремени - МоментВремени - момент документа расхода
// МетодОценки - ПеречислениеСсылка.МетодыОценкиЗапасов - метод на дату
// ПартияИзСтроки - СправочникСсылка.ПартииТоваров - явная партия (если заполнена)
//
// Возвращаемое значение:
// Структура - СтрокиСписания (массив структур), Недостача (число)
//
Функция ПодобратьПартииКСписанию(Склад, Номенклатура, КоличествоКСписанию, МоментВремени, МетодОценки, ПартияИзСтроки) Экспорт

	Результат = Новый Структура("СтрокиСписания, Недостача", Новый Массив, 0);

	ОстаткиПартий = ПолучитьОстаткиПартий(Склад, Номенклатура, МоментВремени, ПартияИзСтроки);
	Если ОстаткиПартий.Количество() = 0 Тогда
		Результат.Недостача = КоличествоКСписанию;
		Возврат Результат;
	КонецЕсли;

	Если МетодОценки = Перечисления.МетодыОценкиЗапасов.LIFO Тогда
		ОстаткиПартий.Сортировать("ДатаПоступления Убыв, Партия Убыв");
	Иначе
		ОстаткиПартий.Сортировать("ДатаПоступления Возр, Партия Возр");
	КонецЕсли;

	СредняяЦена = 0;
	Если МетодОценки = Перечисления.МетодыОценкиЗапасов.ПоСредней Тогда
		ВсегоКоличество = 0;
		ВсегоСтоимость = 0;
		Для Каждого СтрокаОстатка Из ОстаткиПартий Цикл
			ВсегоКоличество = ВсегоКоличество + СтрокаОстатка.Количество;
			ВсегоСтоимость = ВсегоСтоимость + СтрокаОстатка.Стоимость;
		КонецЦикла;
		Если ВсегоКоличество > 0 Тогда
			СредняяЦена = ВсегоСтоимость / ВсегоКоличество;
		КонецЕсли;
	КонецЕсли;

	ИндексыСтрок = Новый Массив;
	Для Индекс = 0 По ОстаткиПартий.Количество() - 1 Цикл
		ИндексыСтрок.Добавить(Индекс);
	КонецЦикла;

	Возврат СписатьИзЛокальныхОстатков(
		ОстаткиПартий,
		ИндексыСтрок,
		КоличествоКСписанию,
		МетодОценки,
		СредняяЦена,
		ПартияИзСтроки);

КонецФункции

Функция ПолучитьОстаткиПартий(Склад, Номенклатура, МоментВремени, ПартияИзСтроки)

	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Номенклатура);
	Остатки = ПолучитьОстаткиПартийПакетом(Склад, МассивНоменклатуры, МоментВремени);

	Если Не ЗначениеЗаполнено(ПартияИзСтроки) Тогда
		Возврат Остатки;
	КонецЕсли;

	Результат = Остатки.СкопироватьКолонки();
	Для Каждого СтрокаОстатка Из Остатки Цикл
		Если СтрокаОстатка.Партия = ПартияИзСтроки Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаОстатка);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Описание: Читает остатки партий по списку номенклатуры одним запросом.
//
Функция ПолучитьОстаткиПартийПакетом(Склад, МассивНоменклатуры, МоментВремени)

	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТиповНоменклатура);
	Для Каждого ЭлементНоменклатуры Из МассивНоменклатуры Цикл
		СтрокаТаблицы = ТаблицаНоменклатуры.Добавить();
		СтрокаТаблицы.Номенклатура = ЭлементНоменклатуры;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Партия КАК Партия,
	|	ЕСТЬNULL(ПартииТоваров.ДатаПоступления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	Остатки.СтоимостьОстаток КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&МоментВремени,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТНоменклатура.Номенклатура
	|					ИЗ
	|						ВТНоменклатура КАК ВТНоменклатура)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииТоваров КАК ПартииТоваров
	|		ПО Остатки.Партия = ПартииТоваров.Ссылка
	|ГДЕ
	|	Остатки.КоличествоОстаток > 0";

	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаНоменклатуры);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Описание: Возвращает соответствие Номенклатура -> ТипНоменклатуры одним запросом.
//
Функция ПолучитьТипыНоменклатурыПакетом(ТабличнаяЧастьТовары)

	Результат = Новый Соответствие;
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", ОписаниеТиповНоменклатура);

	Уникальные = Новый Соответствие;
	Для Каждого СтрокаТовара Из ТабличнаяЧастьТовары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Если Уникальные.Получить(СтрокаТовара.Номенклатура) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Уникальные.Вставить(СтрокаТовара.Номенклатура, Истина);
		СтрокаТаблицы = ТаблицаНоменклатуры.Добавить();
		СтрокаТаблицы.Номенклатура = СтрокаТовара.Номенклатура;
	КонецЦикла;

	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТНоменклатура.Номенклатура
	|			ИЗ
	|				ВТНоменклатура КАК ВТНоменклатура)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Номенклатура, Выборка.ТипНоменклатуры);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция РассчитатьСредниеЦеныПоНоменклатуре(ОстаткиПартий)

	Итоги = Новый Соответствие;
	Для Каждого СтрокаОстатка Из ОстаткиПартий Цикл
		ДанныеИтога = Итоги.Получить(СтрокаОстатка.Номенклатура);
		Если ДанныеИтога = Неопределено Тогда
			ДанныеИтога = Новый Структура("Количество, Стоимость", 0, 0);
		КонецЕсли;
		ДанныеИтога.Количество = ДанныеИтога.Количество + СтрокаОстатка.Количество;
		ДанныеИтога.Стоимость = ДанныеИтога.Стоимость + СтрокаОстатка.Стоимость;
		Итоги.Вставить(СтрокаОстатка.Номенклатура, ДанныеИтога);
	КонецЦикла;

	СредниеЦены = Новый Соответствие;
	Для Каждого КлючИЗначение Из Итоги Цикл
		ДанныеИтога = КлючИЗначение.Значение;
		Если ДанныеИтога.Количество > 0 Тогда
			СредниеЦены.Вставить(КлючИЗначение.Ключ, ДанныеИтога.Стоимость / ДанныеИтога.Количество);
		Иначе
			СредниеЦены.Вставить(КлючИЗначение.Ключ, 0);
		КонецЕсли;
	КонецЦикла;

	Возврат СредниеЦены;

КонецФункции

Функция ПостроитьИндексОстатковПоНоменклатуре(ОстаткиПартий)

	Индекс = Новый Соответствие;
	Для ИндексСтроки = 0 По ОстаткиПартий.Количество() - 1 Цикл
		Номенклатура = ОстаткиПартий[ИндексСтроки].Номенклатура;
		МассивИндексов = Индекс.Получить(Номенклатура);
		Если МассивИндексов = Неопределено Тогда
			МассивИндексов = Новый Массив;
			Индекс.Вставить(Номенклатура, МассивИндексов);
		КонецЕсли;
		МассивИндексов.Добавить(ИндексСтроки);
	КонецЦикла;
	Возврат Индекс;

КонецФункции

Функция СписатьИзЛокальныхОстатков(ОстаткиПартий, ИндексыСтрок, КоличествоКСписанию, МетодОценки, СредняяЦена, ПартияИзСтроки)

	Результат = Новый Структура("СтрокиСписания, Недостача", Новый Массив, 0);

	Если ИндексыСтрок = Неопределено Или ИндексыСтрок.Количество() = 0 Тогда
		Результат.Недостача = КоличествоКСписанию;
		Возврат Результат;
	КонецЕсли;

	ОтборПоПартии = ЗначениеЗаполнено(ПартияИзСтроки);

	// Сначала проверка доступного количества без изменения остатков
	Доступно = 0;
	Для Каждого ИндексСтроки Из ИндексыСтрок Цикл
		СтрокаОстатка = ОстаткиПартий[ИндексСтроки];
		Если ОтборПоПартии И СтрокаОстатка.Партия <> ПартияИзСтроки Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаОстатка.Количество > 0 Тогда
			Доступно = Доступно + СтрокаОстатка.Количество;
		КонецЕсли;
	КонецЦикла;

	Если Доступно < КоличествоКСписанию Тогда
		Результат.Недостача = КоличествоКСписанию - Доступно;
		Возврат Результат;
	КонецЕсли;

	ОсталосьСписать = КоличествоКСписанию;
	Для Каждого ИндексСтроки Из ИндексыСтрок Цикл

		Если ОсталосьСписать <= 0 Тогда
			Прервать;
		КонецЕсли;

		СтрокаОстатка = ОстаткиПартий[ИндексСтроки];
		Если ОтборПоПартии И СтрокаОстатка.Партия <> ПартияИзСтроки Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаОстатка.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СписатьКоличество = Мин(ОсталосьСписать, СтрокаОстатка.Количество);
		Если СписатьКоличество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Если МетодОценки = Перечисления.МетодыОценкиЗапасов.ПоСредней Тогда
			СписатьСтоимость = Окр(СписатьКоличество * СредняяЦена, 2);
		ИначеЕсли СтрокаОстатка.Количество = СписатьКоличество Тогда
			СписатьСтоимость = СтрокаОстатка.Стоимость;
		Иначе
			СписатьСтоимость = Окр(СтрокаОстатка.Стоимость * СписатьКоличество / СтрокаОстатка.Количество, 2);
		КонецЕсли;

		СтрокаСписания = Новый Структура("Партия, Количество, Стоимость",
			СтрокаОстатка.Партия, СписатьКоличество, СписатьСтоимость);
		Результат.СтрокиСписания.Добавить(СтрокаСписания);

		СтрокаОстатка.Количество = СтрокаОстатка.Количество - СписатьКоличество;
		СтрокаОстатка.Стоимость = СтрокаОстатка.Стоимость - СписатьСтоимость;
		ОсталосьСписать = ОсталосьСписать - СписатьКоличество;

	КонецЦикла;

	Если ОсталосьСписать > 0 Тогда
		// Не должно происходить после предварительной проверки; страховка
		Результат.Недостача = ОсталосьСписать;
		Результат.СтрокиСписания.Очистить();
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ОбновитьПартиюПрихода(ПартияСсылка, ДокументОбъект, СтрокаТовара)

	ПартияОбъект = ПартияСсылка.ПолучитьОбъект();
	ПартияОбъект.ДокументПрихода = ДокументОбъект.Ссылка;
	ПартияОбъект.ДатаПоступления = ДокументОбъект.Дата;
	ПартияОбъект.Номенклатура = СтрокаТовара.Номенклатура;
	ПартияОбъект.Склад = ДокументОбъект.Склад;
	ПартияОбъект.Цена = СтрокаТовара.Цена;
	ПартияОбъект.Наименование = СтрШаблон(
		"%1 / %2 / %3",
		Строка(СтрокаТовара.Номенклатура),
		Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy"),
		Строка(ДокументОбъект.Номер));
	ПартияОбъект.Записать();

КонецПроцедуры

Функция СоздатьПартиюПрихода(ДокументОбъект, СтрокаТовара)

	ПартияОбъект = Справочники.ПартииТоваров.СоздатьЭлемент();
	ПартияОбъект.Наименование = СтрШаблон(
		"%1 / %2 / %3",
		Строка(СтрокаТовара.Номенклатура),
		Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy"),
		Строка(ДокументОбъект.Номер));
	ПартияОбъект.ДокументПрихода = ДокументОбъект.Ссылка;
	ПартияОбъект.ДатаПоступления = ДокументОбъект.Дата;
	ПартияОбъект.Номенклатура = СтрокаТовара.Номенклатура;
	ПартияОбъект.Склад = ДокументОбъект.Склад;
	ПартияОбъект.Цена = СтрокаТовара.Цена;
	ПартияОбъект.Записать();

	Возврат ПартияОбъект.Ссылка;

КонецФункции

Функция ОбщегоНазначенияТипНоменклатуры(Номенклатура)

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Перечисления.ТипыНоменклатуры.Товар;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипНоменклатуры;
	КонецЕсли;

	Возврат Перечисления.ТипыНоменклатуры.Товар;

КонецФункции
